import 'dotenv/config';
import { bulkSendHT } from './bulkSendHT';
import { HackTUESEmailOptions } from './sendEmail';

async function sendTF() {
  try {
    const emailOptions: Omit<HackTUESEmailOptions, 'to'> = {
      subject: 'Важна информация за TUES Fest 2026',
      text: `Здравейте,

Остават само 3 дни до TUES Fest 2026
Събитието започва в 9:00 на 26.04 на територията на София Тех Парк, форум "Джон Атанасов"
В този имейл ви изпращаме важна информация, която трябва да знаете. 

Програмата на феста е следната:

8:30 - 9:00  - Събиране в София Тех Парк, форум “Джон Атанасов”

09:00 – 10:00
Откриваща церемония
Започваме с вдъхновяващо откриване, в което ще участват специални гости от технологичния и образователния сектор. Ще чуете мотивиращи думи, които ще ви потопят в атмосферата на денят на постиженията в ТУЕС и ще дадат старт на ден, изпълнен с иновации и креативност

10:00 – 15:30 
Изложение на проектите ви пред посетителите
Таблица: https://docs.google.com/spreadsheets/d/19ddpH94SRNmxp_7DaXIbwkTcHot_2OMtNpiFNY444kw/edit?usp=sharing
В тази таблица може да намерите всеки проект и участниците в него на коя маса се намират.
Разпределение на залата ще намерите тук: https://drive.google.com/file/d/1NSt6wjZE-Zn_8CYjMOojJOG35-c3DWhT/view?usp=sharing

11:00 – 13:00 
Pitch to reach
12 избрани отбора ще представят идеята си пред бизнес ориентирано жури, а проектът с най-добра бизнес идея и потенциал за превръщане в реален продукт ще получи специална награда. Посетителите могат да гледат презентациите на място в София Тех Парк. 

15:00 – 15:30
Проверка на TUES Battle Bots
Преди началото на битките ще бъде извършена техническа проверка на всички роботи, участващи в TUES Battle Bots. Проверката има за цел да гарантира, че всички участници спазват регламента и правилата на състезанието, както и че роботите отговарят на изискванията за безопасност и технически спецификации.

15:30 – 17:00
TUES Battle Bots
Моментът от TUES Fest когато всеки зарязва това, което прави и излиза да наблюдава арената. Всеки от вас ще има възможност да гледа ожесточените битки между роботите на участниците, а от арената ще излезе само един победител.

17:30 – 19:30 
Закриваща церемония
Време е за награждаване на победителите в различните категории на TUES Fest 2026. Започва се с наградите на нашите спонсори и партньори и след това с почетните първи три места във всяка категория. 


Елате в 8:30, за да се настаните спокойно за откриващата церемония. Задължително си носете разклонители, както и чашка/кенче или шише за вода, защото ще има машини за вода, от които да си пълните при нужда. Може да си вземете и съд за храна, за да не разхищаваме при купуване на храна от фууд тръковете.

Изпращаме и прикачени по-горе в програмата схемата на масите вътре в залата, както и кой екип на коя маса е в първия шийт и във втория шийт кой участник на коя маса/маси ще бъде.

Моля да го прегледате и да знаете къде е вашата маса, за да се случи по-бързо настаняването в залата.

По време на откриваща церемония в средната част на залата ще има столчета. Веднага след откриващата ще пренаредим и ще сложим масите за тези екипи, които са по средата.

Нямаме търпение да се видим тази неделя и да направим едно уникално събитие!
Очакваме ви!

Поздрави,

Екипът на Hack TUES 12 & TUES Fest 2026`,
      html: `<div>
  <p>Здравейте,</p>

  <p>EMAIL_BODY_HERE</p>

  <p>Оставаме насреща за въпроси!</p>
</div>`,
      fromName: 'team',
    };

    await bulkSendHT(emailOptions);

  } catch (error: any) {
    console.error('\n=== Error ===');
    console.error('Error:', error.message);
    process.exit(1);
  } finally {
    process.exit(0);
  }
}

// Run the function
sendTF();
